DataProcessors/ОбщиеНастройкиТелефонии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ОбщиеНастройкиТелефонии</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ДоступныеАТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ДоступныеАТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MangoOffice</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RiNet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VirginConnect</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авантел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестКоллМосква</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестКоллСПб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарсТелеком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гравител</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеловаяСетьИркутск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДомRu</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МГТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мегафон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаукаСвязь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростелеком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СибирскиеСети</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УниверсальныйItoolabs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Энфорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Яндекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МТТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОбщиеНастройкиТелефонии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбщиеНастройкиПубликацииСервисаАТСItoolabsХранятсяВУниверсальномВиджете(АТС) Экспорт
	
	Если Не Перечисления.ДоступныеАТС.ЭтоПлатформаItoolabs(АТС) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Обработка.ОбщиеНастройкиТелефонии.Форма
	НастройкиАТСКоторыеХранятсяОтдельно = Новый Массив;
	НастройкиАТСКоторыеХранятсяОтдельно.Добавить(Перечисления.ДоступныеАТС.ДомRu);
	НастройкиАТСКоторыеХранятсяОтдельно.Добавить(Перечисления.ДоступныеАТС.ВестКоллМосква);
	НастройкиАТСКоторыеХранятсяОтдельно.Добавить(Перечисления.ДоступныеАТС.ДеловаяСетьИркутск);
	
	НастройкиПереданнойАТСХранятсяОтдельно = НастройкиАТСКоторыеХранятсяОтдельно.Найти(АТС) <> Неопределено;
	
	Возврат Не НастройкиПереданнойАТСХранятсяОтдельно;
	
КонецФункции

#КонецОбласти

#КонецЕсли
